#ifndef __ADC_APP_H__
#define __ADC_APP_H__



#include "sys_app.h"

/* Exported macro ------------------------------------------------------------*/

#define ADC_TIMEOUT 100

/* Exported constants --------------------------------------------------------*/
enum adc_name{
	
	WI1_ADC = 0,
	WI2_ADC,
	WI3_ADC,
	WI4_ADC,
	WI5_ADC,
	TEMP_ADC,
	ADC_MAX,
};

/* Exported functions --------------------------------------------------------*/

/********************************************************
  * 函数功能: 温度计算
  * 输入参数: AD值
  * 返 回 值: 温度值
  * 说    明: 无
********************************************************/
double rc_temp_adc_result(uint32_t temp_adc);
	
/********************************************************
  * 函数功能: ADC任务
  * 输入参数: void
  * 返 回 值: 无
  * 说    明: 无
********************************************************/
void rc_sys_adc_app_poll(void);

#endif
