#ifndef __EEPROMRW_APP_H__
#define __EEPROMRW_APP_H__

#include "sys_app.h"



/* Exported functions ------------------------------------------------------- */
/********************************************************
  * 函数功能: EEPROM 初始化
  * 输入参数: void
  * 返 回 值: void
  * 说    明: 无
********************************************************/
void rc_eeprom_app_init(void);

/********************************************************
  * 函数功能: EEPROM 任务
  * 输入参数: void
  * 返 回 值: void
  * 说    明: 无
********************************************************/
void rc_eeprom_app_poll(void);
	
#endif

