#ifndef __SYS_APP_H__
#define __SYS_APP_H__

#include "main.h"

#include "eepromrw_app.h"
#include "led.h"
#include "adc_app.h"
#include "can_app.h"
#include "i2c_app.h"
#include "w5500_app.h"
#include "CH395_app.h"
#include "usart_app.h"
#include "YT8512.h"

/* Exported macro ------------------------------------------------------------*/

#define CH395_EN 

#define WDI_TIMEOUT 800 //翻转两次电平喂一次狗，所以最长时间=2500/2,最短时间=900/2

/* Exported variables --------------------------------------------------------*/

extern volatile uint8_t g_carriage_num;

/* Exported functions --------------------------------------------------------*/

/********************************************************
  * 函数功能: 获取系统时间节拍
  * 输入参数: void
  * 返 回 值: 时间节拍数  1ms间隔
  * 说    明: 无
********************************************************/
uint32_t rc_sys_timeGet(void);

/********************************************************
  * 函数功能: 判断时间是否超时 最小1ms
  * 输入参数: 超时开始时间Old_time  超时时间pass
  * 返 回 值: 1 超时 0 未超时
  * 说    明: 无
**********************************************************/
uint8_t rc_sys_timeHasPast(uint32_t Old_time, uint32_t pass);

/********************************************************
  * 函数功能: 系统任务状态初始化
  * 输入参数: void
  * 返 回 值: 无
  * 说    明: 无
********************************************************/
void rc_sys_app_init(void);
	
/********************************************************
  * 函数功能: 系统任务调度
  * 输入参数: void
  * 返 回 值: 无
  * 说    明: 无
********************************************************/
void sys_app_poll(void);
#endif
